{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing two header‑related UI features with affected files and metadata.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for many frontend source files.",
  "frontend/index.css": "Tailwind CSS index importing base, components, and utilities.",
  "frontend/index.html": "Basic HTML shell mounting the React app at #root and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with routes for all major pages and renders RouterProvider.",
  "frontend/src/components/branding/UtthanLogo.tsx": "Renders the clinic logo SVG with configurable className.",
  "frontend/src/components/contact/GoogleMapEmbed.tsx": "Embeds a Google Maps iframe for the clinic location inside a responsive container.",
  "frontend/src/components/cta/BookAppointmentButton.tsx": "Button linking to the clinic’s Calendly URL with a calendar icon and styling options.",
  "frontend/src/components/cta/EmailButton.tsx": "Builds a mailto link using clinic info and renders a styled email button.",
  "frontend/src/components/cta/MobileStickyBookingCta.tsx": "Mobile-only sticky footer CTA linking to Calendly with a large secondary button.",
  "frontend/src/components/home/WhoWeAreSection.tsx": "Homepage section with image, clinic intro text, and CTA linking to the About page.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying clinic info, links, services list, and Instagram link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, desktop nav links, mobile menu, and appointment button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper including header, footer, and outlet content area.",
  "frontend/src/components/seo/Seo.tsx": "Applies document title, meta description, and optional JSON‑LD on mount.",
  "frontend/src/components/services/ServiceCard.tsx": "Displays a service card with image fallback, icon, brief details, and a link to the service page.",
  "frontend/src/components/services/ServiceIcon.tsx": "Maps service IDs to Lucide icons and renders the appropriate icon.",
  "frontend/src/content/clinicContent.ts": "Provides static structured content for clinic hero, about, values, story, and promotional sections.",
  "frontend/src/content/conditions.ts": "Defines condition types and a list of common physiotherapy-related conditions with symptoms and treatments.",
  "frontend/src/content/faq.ts": "Contains a list of frequently asked questions and answers for the clinic.",
  "frontend/src/content/reviews.ts": "Exports review data, Google rating info, and helper functions for averaging and counting reviews.",
  "frontend/src/content/services.ts": "Defines service types and a list of physiotherapy services with descriptions, benefits, and metadata.",
  "frontend/src/content/therapists.ts": "Provides therapist profiles including qualifications, specialties, experience, and bios.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and refreshes related queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, logout, and status tracking.",
  "frontend/src/index.css": "Defines Tailwind CSS layers, theme variables, dark mode values, and utility classes for animations, layout, and branding.",
  "frontend/src/lib/clinicInfo.ts": "Exports static clinic information and helper functions to format address and phone links.",
  "frontend/src/lib/seoSchema.ts": "Generates structured data schemas for local business, services, FAQs, and reviews using clinic and content data.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with clinic story, mission, vision, images, and SEO metadata.",
  "frontend/src/pages/ConditionsPage.tsx": "Displays a list of treatable conditions with symptoms and treatment approaches, including SEO setup.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information, action buttons, map embed, and SEO metadata for the clinic.",
  "frontend/src/pages/FaqPage.tsx": "Renders the FAQ page with SEO metadata and a list of expandable question-and-answer items using an accordion.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with hero content, trust badges, services, clinic info, and SEO schema for the local business.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed information for a single service, including hero, image, benefits, and structured SEO data.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a hero section and a grid of all physiotherapy services using ServiceCard components.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders patient reviews with SEO review schema and cards displaying testimonials and ratings.",
  "frontend/src/pages/TherapistsPage.tsx": "Empty placeholder file for a therapists page.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, plugins, and custom design tokens for the project.",
  "project_state.json": "Tracks project configuration, requirements, design updates, and known issues for the clinic website rebuild."
}