{
  "backend/main.mo": "Empty Motoko actor module with no logic.",
  "feature_evidence.json": "Feature evidence report describing logo theming update and related frontend files.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files for reference.",
  "frontend/index.css": "Tailwind CSS base, components, and utilities imports.",
  "frontend/index.html": "HTML entry point mounting React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all main routes and renders RouterProvider.",
  "frontend/src/components/branding/UtthanLogo.tsx": "Themed logo component rendering a styled div placeholder for the clinic logo.",
  "frontend/src/components/contact/GoogleMapEmbed.tsx": "Embeds Google Maps iframe showing clinic location with responsive container.",
  "frontend/src/components/cta/BookAppointmentButton.tsx": "Button linking to the clinic's Calendly booking URL with Calendar icon.",
  "frontend/src/components/cta/EmailButton.tsx": "Email button generating a mailto link using clinic email and optional subject/body.",
  "frontend/src/components/cta/MobileStickyBookingCta.tsx": "Mobile-only fixed bottom booking CTA linking to Calendly.",
  "frontend/src/components/home/WhoWeAreSection.tsx": "Home page section showing clinic intro, doctor info, and link to full story.",
  "frontend/src/components/layout/Footer.tsx": "Footer with clinic info, quick links, services list, and contact details.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, mobile menu, and booking button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapping header, footer, and main outlet.",
  "frontend/src/components/seo/Seo.tsx": "Sets document title, meta description, and optional JSON-LD schema.",
  "frontend/src/components/services/ServiceCard.tsx": "Renders a service card with image fallback, icon, summary text, and a link to the service page.",
  "frontend/src/components/services/ServiceIcon.tsx": "Maps service IDs to Lucide icons and returns the appropriate icon component.",
  "frontend/src/content/clinicContent.ts": "Provides static clinic content including hero text, about section, values, and reasons to choose the clinic.",
  "frontend/src/content/conditions.ts": "Defines condition types and a list of conditions with symptoms and treatments.",
  "frontend/src/content/faq.ts": "Contains FAQ entries with questions and answers for patient guidance.",
  "frontend/src/content/reviews.ts": "Includes review data, Google rating metadata, and helper functions for calculating averages.",
  "frontend/src/content/services.ts": "Defines service types and detailed service entries with descriptions, benefits, and images.",
  "frontend/src/content/therapists.ts": "Provides therapist profiles including qualifications, specialties, experience, and bios.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using Dfinity AuthClient, including login, logout, and identity state.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for theming, plus utility classes for UI effects and logo styling.",
  "frontend/src/lib/clinicInfo.ts": "Exports clinic contact and address info with helpers to format the full address and phone link.",
  "frontend/src/lib/seoSchema.ts": "Generates JSON‑LD schema objects for local business, services, FAQs, and reviews using clinic data.",
  "frontend/src/lib/utils.ts": "Provides a `cn` helper to merge Tailwind and class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the clinic's About page with hero, story, mission, vision, and SEO metadata.",
  "frontend/src/pages/ConditionsPage.tsx": "Displays a list of treatable conditions with descriptions, symptoms, treatments, and SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Shows the clinic's contact details, actions, map embed, and SEO metadata.",
  "frontend/src/pages/FaqPage.tsx": "Renders the FAQ page with SEO metadata and an accordion listing FAQ items.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero section, trust badges, services, and clinic highlights using SEO data.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed service information including images, benefits, and SEO schema based on the selected service.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of all services with a hero section and SEO metadata.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders a testimonials page with patient reviews, star ratings, and a link to Google reviews.",
  "frontend/src/pages/TherapistsPage.tsx": "Displays a team page with therapist profiles, qualifications, and specializations.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, typography, plugins, and container settings.",
  "project_state.json": "Tracks homepage redesign progress, brand‑palette enforcement, asset replacements, and required UI/content fixes for the clinic site. Lists architectural constraints, canonical business details, and known issues like missing images, incorrect colors, and broken hero layout."
}