{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report referencing updates to Pride Moments content and related files.",
  "frontend-file-summaries.txt": "Text file listing summaries of various frontend files and their purposes.",
  "frontend/index.css": "Tailwind base, components, and utilities imports.",
  "frontend/index.html": "HTML entry point with root div and script loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all site routes and wraps them in SiteLayout.",
  "frontend/src/components/branding/UtthanLogo.tsx": "Logo component rendering the clinic SVG logo.",
  "frontend/src/components/contact/GoogleMapEmbed.tsx": "Embeds Google Maps iframe showing the clinic location.",
  "frontend/src/components/cta/BookAppointmentButton.tsx": "Button linking to Calendly with icon and secondary styling.",
  "frontend/src/components/cta/EmailButton.tsx": "Reusable email button generating a mailto link using clinic info.",
  "frontend/src/components/cta/MobileStickyBookingCta.tsx": "Mobile-only sticky booking button linking to Calendly.",
  "frontend/src/components/home/PrideMomentsCarousel.tsx": "Image carousel with navigation, keyboard support, and slide indicators.",
  "frontend/src/components/home/PrideMomentsSection.tsx": "Section displaying Pride Moments content with cards and carousels.",
  "frontend/src/components/home/WhoWeAreSection.tsx": "Home section describing the clinic with image, text, and CTA.",
  "frontend/src/components/layout/Footer.tsx": "Footer with clinic info, quick links, services list, and social link.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with logo, navigation links, mobile menu toggle, and appointment button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Overall page layout rendering header, routed content, and footer.",
  "frontend/src/components/seo/Seo.tsx": "Updates document title, meta description, and optional JSON‑LD on mount/unmount.",
  "frontend/src/components/services/ServiceCard.tsx": "Service preview card showing image, icon, summary, benefits, and link to service details with fallback image handling.",
  "frontend/src/components/services/ServiceIcon.tsx": "Maps service IDs to lucide icons and renders the corresponding icon.",
  "frontend/src/content/clinicContent.ts": "Static content describing clinic hero, about, values, mission, and reasons to choose the clinic.",
  "frontend/src/content/conditions.ts": "Defines condition type and a list of common conditions with symptoms and treatments.",
  "frontend/src/content/faq.ts": "FAQ entries with questions and answers for clinic visitors.",
  "frontend/src/content/prideMoments.ts": "Static data for clinic pride‑moment events including images and descriptions.",
  "frontend/src/content/reviews.ts": "Review data, Google aggregate rating constants, and helper functions for average and count.",
  "frontend/src/content/services.ts": "Defines a Service interface and exports a list of physiotherapy service objects with descriptions, benefits, target audiences, and image metadata.",
  "frontend/src/content/therapists.ts": "Defines a Therapist interface and exports an array of therapist profiles with qualifications, specialties, experience, and bio details.",
  "frontend/src/hooks/useActor.ts": "Provides a React hook that creates and manages a backend actor based on the user's identity, invalidating queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook using DFINITY AuthClient to manage login state, identity loading, and logout.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines custom color variables, dark-mode tokens, utility classes, animations, and branding filters.",
  "frontend/src/lib/clinicInfo.ts": "Exports static clinic information and helper functions for formatting the address and generating a phone link.",
  "frontend/src/lib/seoSchema.ts": "Generates JSON‑LD schema objects for the clinic, services, FAQs, and reviews using clinic metadata and content.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero content, story section, mission and vision cards, and SEO metadata integration.",
  "frontend/src/pages/ConditionsPage.tsx": "Displays a list of treatable conditions with symptoms and treatments using cards and SEO metadata.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details including phone, email, address, and map embed with styled cards and SEO metadata.",
  "frontend/src/pages/FaqPage.tsx": "Renders FAQ items in an accordion layout with SEO and JSON-LD schema.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring hero content, trust badges, service highlights, and various clinic sections with SEO schema.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Displays detailed information for a single service including hero, image, benefits, and SEO schema; handles missing services.",
  "frontend/src/pages/ServicesPage.tsx": "Shows a grid of all services with a hero section and SEO metadata.",
  "frontend/src/pages/TestimonialsPage.tsx": "Lists patient reviews in card layout with hero, SEO metadata, and link to Google reviews.",
  "frontend/src/pages/TherapistsPage.tsx": "Empty file with no implemented content.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended theme settings, custom colors, fonts, radii, shadows, and includes typography, container-queries, and animation plugins.",
  "project_state.json": "Tracks project state, feature requests, and known issues, focusing on fixing and enhancing the Pride Moments carousel with multiple user-uploaded images."
}