{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Metadata describing a feature request to replace a specific image in WhoWeAreSection.tsx.",
  "frontend-file-summaries.txt": "Text file listing summarized descriptions of various frontend files.",
  "frontend/index.css": "Tailwind base, components, and utilities imports.",
  "frontend/index.html": "HTML entry file setting up root div and loading main.tsx.",
  "frontend/src/App.tsx": "Defines TanStack Router routes and renders the router provider.",
  "frontend/src/components/branding/UtthanLogo.tsx": "Simple logo component rendering the clinic's SVG logo.",
  "frontend/src/components/contact/GoogleMapEmbed.tsx": "Google Maps iframe embed component wrapped in a styled container.",
  "frontend/src/components/cta/BookAppointmentButton.tsx": "Button linking to the clinic's Calendly URL with calendar icon.",
  "frontend/src/components/cta/EmailButton.tsx": "Reusable email button generating a mailto link with optional subject/body.",
  "frontend/src/components/cta/MobileStickyBookingCta.tsx": "Mobile‑only sticky booking bar linking to Calendly.",
  "frontend/src/components/home/PrideMomentsSection.tsx": "Section displaying pride‑moment photos with captions in a grid.",
  "frontend/src/components/home/WhoWeAreSection.tsx": "Two‑column section with dr-banner.jpg image and clinic introduction text plus CTA.",
  "frontend/src/components/layout/Footer.tsx": "Footer with about text, quick links, services list, and contact info.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header navigation with logo, links, mobile menu, and booking button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout wrapping header, main content outlet, and footer.",
  "frontend/src/components/seo/Seo.tsx": "React component that sets page title, meta description, and optional JSON-LD in the document head with cleanup on unmount.",
  "frontend/src/components/services/ServiceCard.tsx": "Displays a service card with image fallback, icon, summary info, benefits preview, and a link to the service page.",
  "frontend/src/components/services/ServiceIcon.tsx": "Maps service IDs to lucide-react icons and renders the corresponding icon with optional sizing classes.",
  "frontend/src/content/clinicContent.ts": "Static clinic content including hero text, about section, values, story, and reasons to choose the clinic.",
  "frontend/src/content/conditions.ts": "Defines condition data with symptoms and treatments for various physiotherapy-related issues.",
  "frontend/src/content/faq.ts": "Provides a list of FAQs with questions and detailed answers for patients.",
  "frontend/src/content/prideMoments.ts": "Static content describing clinic pride moments with photo metadata and captions.",
  "frontend/src/content/reviews.ts": "Contains Google rating data, detailed patient reviews, and helper functions for averaging and counting reviews.",
  "frontend/src/content/services.ts": "Defines service metadata including descriptions, benefits, target audience, and images for physiotherapy offerings.",
  "frontend/src/content/therapists.ts": "Defines the Therapist interface and provides a list of therapist profiles with qualifications and bios.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, including login, logout, and identity persistence using AuthClient.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines custom color variables, dark mode styles, and utility classes.",
  "frontend/src/lib/clinicInfo.ts": "Exports clinic contact details and helper functions to format the address and phone link.",
  "frontend/src/lib/seoSchema.ts": "Generates JSON-LD schema objects for local business, services, FAQs, and reviews using clinic data.",
  "frontend/src/lib/utils.ts": "Provides a utility function to merge Tailwind CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero content, clinic story, mission, vision, and SEO metadata.",
  "frontend/src/pages/ConditionsPage.tsx": "Displays a list of treatable conditions with symptoms and treatments, along with page-level SEO.",
  "frontend/src/pages/ContactPage.tsx": "Renders the contact page with phone, email, location details, and a map embed, using cards and SEO metadata.",
  "frontend/src/pages/FaqPage.tsx": "Displays a FAQ page with an accordion of questions and answers and includes structured FAQ SEO data.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with a hero section, trust badges, service highlights, and SEO schema for the business.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a single service, including description, image, benefits, and structured SEO data.",
  "frontend/src/pages/ServicesPage.tsx": "Lists all physiotherapy services in a grid layout with SEO metadata.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders a testimonials page displaying patient reviews with SEO review schema.",
  "frontend/src/pages/TherapistsPage.tsx": "Empty placeholder page for therapist content.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, container settings, animations, and theme extensions.",
  "project_state.json": "Stores project metadata, existing and new feature requests, and configuration flags for the Utthan Clinic project."
}