{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purpose of various frontend files.",
  "frontend/index.css": "TailwindCSS base, component, and utility imports.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes wrapped in SiteLayout.",
  "frontend/src/components/branding/UtthanLogo.tsx": "SVG-based Utthan logo component with stylized icon and text.",
  "frontend/src/components/contact/GoogleMapEmbed.tsx": "Responsive Google Maps iframe embed component for clinic location.",
  "frontend/src/components/cta/BookAppointmentButton.tsx": "Button linking to Calendly with icon and secondary styling.",
  "frontend/src/components/cta/EmailButton.tsx": "Reusable email button generating a mailto link using clinic info.",
  "frontend/src/components/cta/MobileStickyBookingCta.tsx": "Mobile-only sticky booking CTA linking to Calendly.",
  "frontend/src/components/layout/Footer.tsx": "Footer with clinic info, Instagram link, navigation links, and contact details.",
  "frontend/src/components/layout/HeaderNav.tsx": "Responsive header with Utthan logo, navigation links, CTAs, and mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout wrapping header, routed content, and footer with background styling.",
  "frontend/src/components/seo/Seo.tsx": "React component that updates document title, meta description, and optional JSON-LD, cleaning up JSON-LD on unmount.",
  "frontend/src/components/services/ServiceCard.tsx": "UI card displaying a service with image fallback, icon, brief details, benefits, and a link to the service page.",
  "frontend/src/components/services/ServiceIcon.tsx": "Maps service IDs to lucide-react icons and returns the matching icon or a fallback.",
  "frontend/src/content/clinicContent.ts": "Static clinic content including hero text, about section, values, and reasons to choose the clinic.",
  "frontend/src/content/conditions.ts": "Defines Condition type and a list of common physiotherapy-treated conditions with symptoms and treatments.",
  "frontend/src/content/faq.ts": "Exports FAQ type and a list of frequently asked questions with answers.",
  "frontend/src/content/reviews.ts": "Provides review data, Google rating info, and helper functions for averages and counts.",
  "frontend/src/content/services.ts": "Defines Service type and detailed service listings with descriptions, benefits, target audiences, and images.",
  "frontend/src/content/therapists.ts": "Exports therapist profiles with qualifications, specialties, experience, and bios.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refetching dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, including login, logout, status tracking, and AuthClient setup.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom CSS variables for light/dark themes, and utility classes for transitions and layout.",
  "frontend/src/lib/clinicInfo.ts": "Exports static clinic details and helpers for formatting the address and phone link.",
  "frontend/src/lib/seoSchema.ts": "Generates structured schema.org JSON for local business, services, FAQs, and reviews using clinic data.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the clinic's About page with hero section, story, mission, vision, and core values using card components.",
  "frontend/src/pages/ConditionsPage.tsx": "Displays a list of treatable conditions with descriptions, symptoms, and treatment approaches.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact details, address, phone, email, and map embeds with SEO metadata and styled cards.",
  "frontend/src/pages/FaqPage.tsx": "Renders the FAQ page with SEO metadata and an accordion listing questions and answers.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with hero content, trust badges, services, reviews, and SEO metadata.",
  "frontend/src/pages/ServiceDetailPage.tsx": "Shows detailed information for a selected service, including descriptions, images, benefits, and SEO schema.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a hero section and a grid of all physiotherapy services using ServiceCard components.",
  "frontend/src/pages/TestimonialsPage.tsx": "Renders patient testimonials with ratings, quotes, and SEO review schema.",
  "frontend/src/pages/TherapistsPage.tsx": "Lists clinic therapists with bios, qualifications, specializations, and a hero intro.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, container settings, and plugins.",
  "project_state.json": "Defines the project’s current version, required homepage redesign, brand palette rules, UI expectations, and canonical clinic details. Lists major known issues such as incorrect colors, missing images, wrong NAP data, and hero quality problems to be fixed."
}