{
  "kind": "build_request",
  "title": "Remove logo from mobile menu and recolor header logo to #70316c",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-65",
      "text": "Remove the logo from the mobile menu so the logo appears only in the main site header (do not render any logo inside the opened mobile navigation panel/menu).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4",
          "recent-messages-5"
        ],
        "quotes": [
          "remove logo from menu and just keep it in header",
          "1 remove from menu, it should be just in header"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, opening the hamburger menu does not show any logo within the menu panel (no top bar logo, no duplicate logo).",
        "The site header (top bar) still displays the logo and remains clickable to navigate to Home.",
        "Desktop header continues to display the logo as before."
      ]
    },
    {
      "id": "REQ-66",
      "text": "Ensure the header logo is colored exactly #70316c everywhere it appears in the header (desktop header and mobile header top bar), using the same uploaded logo.svg asset.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4",
          "recent-messages-5"
        ],
        "quotes": [
          "and logo should be colored with #70316c",
          "2 yes",
          "3 yes"
        ]
      },
      "acceptanceCriteria": [
        "The rendered logo color in the header matches exactly #70316c (visually and via computed styles where applicable).",
        "No other UI elements are unintentionally recolored when applying the logo color.",
        "The logo continues to render as a graphic (not alt text) and uses the same logo.svg asset path consistently."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit any frontend immutablePaths listed in SYSTEM_CONTEXT (compose instead).",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not change navigation labels, routes, or page structure.",
    "Do not redesign the header layout beyond removing the mobile menu logo and adjusting logo color."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}